package com.example.doc_app;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

public class b33 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_b33);

        ImageView imgv_tb=(ImageView)findViewById(R.id.imgv_tb);
        imgv_tb.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                finish();
            }
        });

        TextView textView = (TextView)findViewById(R.id.texview3);
        textView.setText(
                "لا يوجد لمعظم أمراض الرئة المقيدة علاج خاص، ويكون العلاج الدوائي المعطى في الأساس علاجًا مضادًّا للالتهاب (ستيرويدات) وعلاجًا مثبطًا للمناعة (بالأساس سيكلوفسفاميد – Cyclophosphamide). تتم معالجة المرضى الذين هم في مراحل متقدمة من المرض، ويعانون من أعراض متفشية (ضيق تنفس، سعال)، والمرضى الذين يعانون من أداء رئوي منخفض.\n" +
                        "\n" +
                        "يستجيب جزء من المرضى للعلاج فقط. إن لهذه الأدوية بشكل عام أعراضًا جانبية غير سهلة، ولذلك يجب دائمًا التفكير مليًّا في الفائدة التي يجنيها المريض من العلاج.\n" +
                        "\n" +
                        "نبدأ العلاج دائمًا، بجرعات مرتفعة من الستيرويدات. إذا لم يطرأ تحسن على حالة المريض، نقوم بإضافة السيكلوفسفاميد. يمكن في الحالات الصعبة، الأخذ بعين الاعتبار، استعمال أدوية أخرى مثبطة لجهاز المناعة. بالإضافة لهذا، على المريض التوقف عن التدخين، اتباع نظام غذائي صحي ومتوازن، ويجب تشجيعه على المشاركة ببرنامج إعادة تأهيل، بهدف الاعتياد على تحمل الجهود اليومية. تكون هناك حاجة أحيانًا، لإضافة الأكسجين بشكل دائم، لمعالجة السعال المزمن بشكل محدد، ولعلاج العدوى في مسالك التنفس، ولعلاج الأمراض الأخرى التي يعاني منها المريض.\n" +
                        "\n" +
                        "يجب الأخذ بعين الاعتبار، في الحالات المتقدمة أو عند تفاقم الحالة الصحية الإسراع بإدخال المريض إلى قائمة الانتظار لزرع رئة – يتم اللجوء لهذه الإمكانية كحّل أخير لعلاج المرضى المصابين بهذا المرض. إن العملية الجراحية المتعارف عليها هي زرع رئة واحدة. يطرأ بعد الجراحة، بشكل عام، تحسن ملحوظ على جودة حياة المريض. يتم اليوم، إجراء العديد من الأبحاث الكبيرة في العالم، في محاولة لإيجاد العلاج الأمثل، للمرضى الذين يعانون من أمراض الرئة الخلالية.\n"
        );
    }
}