package com.example.doc_app;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

public class b43 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_b43);

        ImageView imgv_tb=(ImageView)findViewById(R.id.imgv_tb);
        imgv_tb.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                finish();
            }
        });

        TextView textView = (TextView)findViewById(R.id.texview33);
        textView.setText(
                "1- الزنجبيل\n" +
                        "يجب أن يكون الزنجبيل جزءا أساسيا من النظام الغذائي الخاص بك، وخاصة إذا كنت تعاني من مشاكل في الجهاز الهضمي.\n" +
                        "\n" +
                        "فوائد الزنجبيل لحل المشاكل الهضمية:\n" +
                        "يساعد في التخلص من الغثيان والقيء، إذ يعتبر بمثابة منبه للدورة الدموية\n" +
                        "يساعد في الافراج عن العصائر الهضمية والانزيمات اللازمة لهضم الطعام بشكل صحيح.\n" +
                        "يساعد في العلاج من الالتهابات المختلفة واضطرابات المعدة\n" +
                        "يعد من أهم أنواع المسكنات للالام.\n" +
                        "كيفية إضافة الزنجبيل إلى النظام الغذائي:\n" +
                        " شاي الزنجبيل: يمكنك إضافة حوالي 4 ملاعق صغيرة من الزنجبيل المبشور الطازج إلى كوبين من الماء وتركها تنضج لمدة تتراوح بين 10 الى 20 دقيقة. ويمكنك ايضا اضافة معلقة من العسل للتخفيف من حرقة الزنجبيل.\n" +
                        " إضافة الزنجبيل إلى العصير: يمكن إضافة جذر الزنجبيل الطازج إلى أي عصير. من خلال إضافة قطعة من الزنجبيل إلى جانب أي نوع من العصير كالتفاح والجزر وبعض عصير الليمون.\n" +
                        " إضافة الزنجبيل إلى الطعام: يمكن إضافة الزنجبيل الطازج إلى أي نوع من الأطعمة فهو العنصر الذي يمكن أن يضاف إلى جانب جميع انواع التوابل في مختلف الوجبات.\n" +
                        "2- خل التفاح\n" +
                        "خل التفاح هو عبارة عن محلول مخفف من حمض الخليك الناتج عن عملية تخمر لبعض السكريات الموجودة في المواد الغذائية سواء الفواكه، وغيره مما يحوي السكر في مكوناته.\n" +
                        "\n" +
                        "فوائد خل التفاح للتخلص من المشاكل الهضمية :\n" +
                        "مضاد حيوي طارد وقاتل للطفيليات والجراثيم.\n" +
                        "له دورا في تهدئة تقلصات الأمعاء بسبب احتواء التفاح على البكتين.\n" +
                        "يمكن أن يساعد جسمك على التخلص من الفطريات، فهو غني بالإنزيمات الطبيعية التي يمكن أن تساعد على تخليص الجسم من الفطريات والخمائر التي تسبب مرض القلاع.\n" +
                        "تحسين عملية الهضم لأنه يزيد من حمض المعدة.\n" +
                        "يمكن أن يمنع اضطرابات الجهاز الهضمي المتعلقة بالعدوى مثل التهاب أو الإسهال.\n" +
                        "كيفية إضافة خل التفاح إلى النظام الغذائي:\n" +
                        " شرب ملعقة كبيرة من خل التفاح ممزوجة في كوب من الماء الدافئ مع القليل من العسل بعد كل وجبة يساعد على منع عسر الهضم والحرقة.\n" +
                        "للإمساك، عليك شرب ملاعتين صغيرتين ممزوجتان في كوب من الماء عند الاستيقاظ، مع وجبة الطعام.\n" +
                        "للإسهال، عليك بشرب ملعقة صغيرة ممزوجة في المياه 275ml خمس مرات يوميا.\n" +
                        "يمكنك إضافة العسل لخل التفاح في حال كنت تكره الطعم.\n" +
                        "\n" +
                        "3- النعناع\n" +
                        "المركبات في زيت النعناع لها خصائص مضادة للتشنج، والتي تقلل من تشنجات الأمعاء. كما أنها تساعد على تحقيق التوازن بين النباتات المعوية ومنع الطعام غير المهضوم من التخمير.\n" +
                        "\n" +
                        "فوائد النعناع في التخلص من المشاكل الهضمية:\n" +
                        "يعمل النعناع على زيادة إفراز ونشاط الغدد اللعابية والانزيمات الهاضمة مما يساعد الجهاز الهضمي في عملية الهضم، ويساعد في علاج حالات عسر الهضم.\n" +
                        "يعتبر النعناع فاتحاً للشهية ولهذا فهو متعارف عليه كمقبلات ويدخل في العديد من أطباق الطهي.\n" +
                        "يلعب دورا أساسيا في علاج مشاكل القولون العصبي عند كل من الأطفال والبالغين.\n" +
                        "يعتبر بمثابة مهدىء لالام المغص و تقلصات المعدة، ويساعد في التغلب على الحموضة  ويتخلص من انتفاخ البطن.\n" +
                        "مطهر ومضاد للالتهابات.\n" +
                        "كيفية إضافة النعناع إلى النظام الغذائي:\n" +
                        " شاي النعناع لذيذ ويمكن أن يتم عن طريق إضافة ملعقة صغيرة من أوراق النعناع المجففة إلى كوب من الماء الساخن.\n" +
                        " إضافة أوراق النعناع كمقبلات للسلطات.\n" +
                        " إضافة  قطرة صغيرة من زيت النعناع في الماء الساخن مع بعض الليمون والزنجبيل يمكن أن يخلص المعدة من الضيق.   \n" +
                        "4- الموز\n" +
                        "الموز له فوائد كبيرة للهضم، لأنه يحتوي على الكثير من الألياف وكذلك يمكن هضمه بسهولة. يمكن اكله بسهولة عند الإصابة بالإسهال أو القيء.\n" +
                        "\n" +
                        "يحتوي الموز على حوالي 30٪ من الألياف القابلة للذوبان، التي تساعد على إبطاء امتصاص الدهون والكربوهيدرات.\n" +
                        "يقلل من القرح المعدية المزمنة، ويحمي من تهيج القرحة.\n" +
                        "يساعد في التخلص من التهابات القولون.\n" +
                        "يساعد في التخلص من الحموضة المعوية والحرقة في المعدة"
        );
    }
}