package com.example.doc_app;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

public class b53 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_b53);

        ImageView imgv_tb=(ImageView)findViewById(R.id.imgv_tb);
        imgv_tb.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                finish();
            }
        });

        TextView textView = (TextView)findViewById(R.id.texview333);
        textView.setText(
                "يشمل علاج امراض الدماغ الخفيفة في العادة بم يلي:\n" +
                        "\n" +
                        "الراحة في السرير\n" +
                        "شُرب الكثير من السوائل\n" +
                        "الأدوية المضادة للالتهابات — مثل الأسِيتامينُوفين (تايلينول، وغيره)، والأيبوبروفين (أدفيل، وموترين آي بي، وغيرهما) ونابروكسين الصوديوم (أليف) — لتخفيف الصداع والحُمّى\n" +
                        "الأدوية المضادة للفيروسات\n" +
                        "عادةً ما يتطلب التهاب الدماغ الناجم عن بعض الفيروسات علاجًا مضادًا للفيروسات.\n" +
                        "\n" +
                        "تشمل الأدوية المضادة للفيروسات التي يشيع استخدامها لعلاج التهاب الدماغ ما يلي:\n" +
                        "\n" +
                        "آسيكلوفير (زوفيراكس)\n" +
                        "جانسيكلوفير (سيتوفين)\n" +
                        "فوسكارنيت (فوسكافير)\n" +
                        "لا تستجيب بعض الفيروسات، مثل الفيروسات التي تنقلها الحشرات، لهذه الوسائل العلاجية. ولكن نظرًا لأنه قد لا يتم التعرف على الفيروس المحدد على الفور أو على الإطلاق، يوصي الأطباء غالبًا بالعلاج الفوري باستخدام أسيكلوفير. ويمكن أن يكون أسيكلوفير فعالًا ضد فيروس الهربس البسيط، والذي يمكن أن يؤدي إلى مضاعفات كبيرة إذا لم يتم علاجه على الفور.\n" +
                        "\n" +
                        "الأدوية المضادة للفيروسات يمكن تحملها بشكل جيد بصفة عامة. وفي حالات نادرة، يمكن أن تشمل الآثار الجانبية تلف الكلى.\n" +
                        "\n" +
                        "الرعاية الداعمة\n" +
                        "قد يحتاج الأشخاص المحجوزون في المستشفى بسبب الإصابة بالتهاب الدماغ الحاد لما يلي:\n" +
                        "\n" +
                        "الأجهزة المساعدة في التنفس، بالإضافة إلى المتابعة الدقيقة لوظائف القلب والتنفس\n" +
                        "السوائل الوريدية لضمان الحصول على الترطيب المناسب والمستويات المناسبة للمعادن الأساسية\n" +
                        "العقاقير المضادة للالتهابات، مثل الستيرويدات القشرية لتقليل التورم والضغط في الجمجمة\n" +
                        "الأدوية المضادة للتشنجات، مثل فينيوتين (ديلانتين) لإيقاف النوبات أو الوقاية منها\n" +
                        "العلاج في مرحلة المتابعة\n" +
                        "وفي حالة الإصابة بمضاعفات التهاب الدماغ، قد يحتاج المريض إلى العلاج الإضافي، مثل ما يلي:\n" +
                        "\n" +
                        "العلاج الطبيعي لتحسين القوة والمرونة والتوازن والتنسيق الحركي والحركة\n" +
                        "العلاج المهني لتنمية المهارات اليومية واستخدام المنجات التكيُّفية التي تساعد في ممارسة الأنشطة اليومية\n" +
                        "علاج التخاطب لإعادة تعلُّم التحكم في العضلات والتنسيق لتنفيذ عملية التخاطب\n" +
                        "العلاج النفسي لتعلُّم إستراتيجيات التأقلم والمهارات السلوكية الجديدة لتحسين الاضطرابات المزاجية أو علاج التغييرات في الشخصية"
        );
    }
}