package com.example.doc_app;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

public class b54 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_b54);

        ImageView imgv_tb=(ImageView)findViewById(R.id.imgv_tb);
        imgv_tb.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                finish();
            }
        });

        TextView textView = (TextView)findViewById(R.id.texview444);
        textView.setText(
                "10 أشياء يمكنك فعلها لتعزيز تكوين الخلايا العصبية والحفاظ على صحة مخك مدى الحياة:\n" +
                        "\n" +
                        "1- تجنَّب الأطعمة الغنية بالدهون المشبعة والسكريات المكرَّرة\n" +
                        "تعمل الأطعمة الغنية بالدهون المشبعة والسكريات المكرَّرة على زيادة الإجهاد التأكسدي والالتهابات في المخ؛ مما يخلق بيئة سيئة لاستمرار تكوين الخلايا العصبية.\n" +
                        "\n" +
                        "2- تناول طعاماً صحياً\n" +
                        "أضِف المزيد من الخضراوات الورقية الداكنة والتوت والعنب إلى نظامك الغذائي، بالإضافة إلى الأطعمة الغنية بالأحماض الدهنية غير المشبعة المتعددة مثل الجوز وبذور الشيا وبذور الكتان.\n" +
                        "\n" +
                        "تساعد هذه الأطعمة على خلق بيئة مثالية لتكوين خلايا دماغية جديدة.\n" +
                        "\n" +
                        "3- اشرب عصير الكركم كل صباح\n" +
                        "كشفت دراسة في أبحاث وعلاج الخلايا الجذعية احتواء الكركم على مركب حيوي يعزز تجديد الخلايا الجذعية في المخ.\n" +
                        "\n" +
                        "لذلك فإن المداومة على شربه يومياً كل صباح تساهم في الحفاظ على صحة الدماغ.\n" +
                        "\n" +
                        "4- تناول قطعة من الشوكولا الداكنة يومياً\n" +
                        "من فوائد الشوكولا الداكنة احتواؤها على مركبات الفلافانول التي تُمتص وتُجمع في أجزاء المخ المسؤولة عن التعلُّم والذاكرة.\n" +
                        "\n" +
                        "تزيد مركبات الفلافانول أيضاً تدفق الدم إلى المخ؛ مما يدعم تكوين خلايا جديدة ويعزز الروابط بين الخلايا العصبية.\n" +
                        "\n" +
                        "وللحصول على أفضل النتائج، اختر أنواعاً عالية الجودة من الشوكولاته الداكنة تحتوي على الأقل على نسبة 70% من الكاكاو.\n" +
                        "\n" +
                        "5- مارس التأمل يومياً\n" +
                        "يساعد التأمل على زيادة كثافة المادة الرمادية في مختلف أجزاء المخ، بما فيها الحُصين.\n" +
                        "\n" +
                        "وقد تؤدي ممارسة التأمل إلى زيادة مستويات هرمون الميلاتونين الذي يدعم تكوين الخلايا العصبية.\n" +
                        "\n" +
                        "يحد الإجهاد والقلق والاكتئاب من تكوين الخلايا العصبية، ويمكن تقليل ذلك من خلال التأمل؛ مما يساعد على تكوين خلايا دماغية جديدة.\n" +
                        "\n" +
                        "6- مارس الرياضة لمدة 30 دقيقة على الأقل يومياً\n" +
                        "تزيد ممارسة الرياضة من مستويات عامل التغذية العصبية المستمد من الدماغ (BDNF) وعامل التغذية العصبية المستمد من الخلايا الدبقية (GDNF)، اللذين يدعمان تكوين الخلايا العصبية.\n" +
                        "\n" +
                        "تزداد مستويات هرمون التستوستيرون أيضاً في أثناء ممارسة الرياضة، وهو ما له أيضاً تأثير إيجابي على تكوين الخلايا العصبية ويمنع آثار الإجهاد النفسي.\n" +
                        "\n" +
                        "7- اتبِّع نظام الصيام المتقطع\n" +
                        "يزيد الصيام المتقطع من اللدونة المشبكية ويعزز نمو الخلايا العصبية ويقلل من خطر الإصابة بالأمراض العصبية التنكسية ويعزز الوظائف الإدراكية، وذلك وفقاً لجمعية علم الأعصاب.\n" +
                        "\n" +
                        "في أثناء الصيام، تنخفض مستويات هرمون اللبتين، وهو هرمون يُنتَّج عن طريق الدهون.\n" +
                        "\n" +
                        "ونتيجة لذلك، يتلقى المخ إشارة كيميائية للخلايا العصبية لإنتاج المزيد من الطاقة.\n" +
                        "\n" +
                        "8- احصل على قسط كافٍ من النوم\n" +
                        "أثناء النوم، يكوِّن المخ الذكريات ويزيل السموم ويصلح الخلايا ويجدد نفسه.\n" +
                        "\n" +
                        "وعلى النقيض من ذلك، تؤدي قلة النوم إلى انخفاض في تكوين الخلايا العصبية بالحُصين.\n" +
                        "\n" +
                        "يمكن لقلة النوم على المدى الطويل أن تضعف وظائف المخ والتسبب في الإصابة بالأمراض العصبية التنكسية.\n" +
                        "\n" +
                        "هذا يسلط الضوء على أهمية الحصول على سبع إلى تسع ساعات من النوم كل ليلة للحفاظ على صحة الدماغ.\n" +
                        "\n" +
                        "إذا وجدت صعوبة في الحصول على نوم جيد، حاول أن تتبع طقوساً محددة قبل النوم أو اتباع جدول محدد لساعات النوم أو شرب بعض أنواع الشاي التي تساعد على النوم أو اجعل غرفتك مظلمة قدر الإمكان.\n" +
                        "\n" +
                        "9- السفر\n" +
                        "عندما تسافر، يصبح مخك معرضاً لبيئات جديدة ومعقدة، وبالتالي تساعد هذه المواقف الجديدة والصعبة في تعزيز تكوين خلايا دماغية جديدة.\n" +
                        "\n" +
                        "10- الرقص\n" +
                        "صدق أو لا تصدق، لكن يُعتبر الرقص مفيداً للمخ؛ لأنه يزيد من التواصل العصبي.\n" +
                        "\n" +
                        "عندما ترقص، تعمل العديد من وظائف المخ -مثل الوظائف الحركية والعقلانية والموسيقية والعاطفية- سوياً في وقت واحد."
        );
    }
}